# UnableToCreateAttachedGroup Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GroupFailures..::..UnableToCreateAttachedGroup Property
BuiltInFailures..::..GroupFailures Class See Also
---
Unable to create attached detail group in view '[View Name]' for the selected elements.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId UnableToCreateAttachedGroup { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property UnableToCreateAttachedGroup As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ UnableToCreateAttachedGroup {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GroupFailures Class
Autodesk.Revit.DB Namespace